Revit 2027 API
Sketch.SketchPlane Property
 Returns the Sketch Plane of the Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SketchPlane SketchPlane { get; }
Public ReadOnly Property SketchPlane As SketchPlane
	Get
public:
property SketchPlane^ SketchPlane {
	SketchPlane^ get ();
}
member SketchPlane : SketchPlane with get
Property Value
SketchPlane
Remarks
 This property is used to retrieve the Sketch Plane of Sketch.
See Also
Reference
Sketch Class
Autodesk.Revit.DB Namespace